examples-results/HsacExamples.SlimTests.HttpTests.HttpPost1Test.html

<html><head><title>HsacExamples.SlimTests.HttpTests.HttpPost1Test</title><meta http-equiv='Content-Type' content='text/html;charset=UTF-8'/><link rel='stylesheet' type='text/css' href='css/fitnesse.css'/><script src='javascript/jquery-1.11.3.min.js' type='text/javascript'></script><script src='javascript/fitnesse.js' type='text/javascript'></script></head><body><header><h2>HsacExamples.SlimTests.HttpTests.HttpPost1Test</h2></header><article><br/><h2 id="BodyinWiki">Body in Wiki</h2>
<br/>Send a HTTP POST supplying the content to post in a variable so the script table does not have newlines in its cells.<br/><br/><span class="meta">variable defined: POST_BODY= {{{
&lt;s11:Envelope xmlns:s11="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s11:Body&gt;
    &lt;ns1:AddInteger xmlns:ns1="http://tempuri.org"&gt;
      &lt;ns1:Arg1&gt;10&lt;/ns1:Arg1&gt;
      &lt;ns1:Arg2&gt;11&lt;/ns1:Arg2&gt;
    &lt;/ns1:AddInteger&gt;
  &lt;/s11:Body&gt;
&lt;/s11:Envelope&gt;
}}} </span>
<br/><br/><table>
	<tr class="slimRowTitle">
		<td>script</td>
		<td colspan="3"><span class="pass">xml http test</span></td>
	</tr>
	<tr class="slimRowColor5">
		<td>set value</td>
		<td><a href="http://tempuri.org/SOAP.Demo.AddInteger">http://tempuri.org/SOAP.Demo.AddInteger</a></td>
		<td>for header</td>
		<td>SOAPAction</td>
	</tr>
	<tr class="slimRowColor4">
		<td><span class="pass">post</span></td>
		<td><pre>
&lt;s11:Envelope xmlns:s11="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s11:Body&gt;
    &lt;ns1:AddInteger xmlns:ns1="http://tempuri.org"&gt;
      &lt;ns1:Arg1&gt;10&lt;/ns1:Arg1&gt;
      &lt;ns1:Arg2&gt;11&lt;/ns1:Arg2&gt;
    &lt;/ns1:AddInteger&gt;
  &lt;/s11:Body&gt;
&lt;/s11:Envelope&gt;
</pre></td>
		<td>to</td>
		<td>http://www.crcind.com/csp/samples/SOAP.Demo.cls</td>
	</tr>
	<tr class="slimRowColor0">
		<td>check</td>
		<td>response status</td>
		<td colspan="2"><span class="pass">200</span></td>
	</tr>
	<tr class="slimRowColor9">
		<td>show</td>
		<td colspan="3">response</td>
	<td><pre>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;&lt;SOAP-ENV:Envelope xmlns:SOAP-ENV=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:s=&quot;http://www.w3.org/2001/XMLSchema&quot;&gt;
    &lt;SOAP-ENV:Body&gt;
        &lt;AddIntegerResponse xmlns=&quot;http://tempuri.org&quot;&gt;
            &lt;AddIntegerResult&gt;21&lt;/AddIntegerResult&gt;
        &lt;/AddIntegerResponse&gt;
    &lt;/SOAP-ENV:Body&gt;
&lt;/SOAP-ENV:Envelope&gt;
</pre></td></tr>
	<tr class="slimRowColor9">
		<td>show</td>
		<td colspan="3">response headers</td>
	<td><table class="hash_table">
	<tr class="hash_row">
		<td class="hash_key">Cache-Control</td>
		<td class="hash_value">no-cache</td>
	</tr>
	<tr class="hash_row">
		<td class="hash_key">Pragma</td>
		<td class="hash_value">no-cache</td>
	</tr>
	<tr class="hash_row">
		<td class="hash_key">Content-Length</td>
		<td class="hash_value">382</td>
	</tr>
	<tr class="hash_row">
		<td class="hash_key">Content-Type</td>
		<td class="hash_value">text/xml; charset=UTF-8</td>
	</tr>
	<tr class="hash_row">
		<td class="hash_key">Expires</td>
		<td class="hash_value">Thu, 29 Oct 1998 17:04:19 GMT</td>
	</tr>
	<tr class="hash_row">
		<td class="hash_key">Server</td>
		<td class="hash_value">Microsoft-IIS/7.5</td>
	</tr>
	<tr class="hash_row">
		<td class="hash_key">Set-Cookie</td>
		<td class="hash_value">[CSPSESSIONID-SP-80-UP-csp-samples-=003000010000ADcPLx5nM90000OO4vUtJ$_DNe$CCumx1a4w--; path=/csp/samples/;  httpOnly;, CSPWSERVERID=13bc9382e4d9f5d2fe110cb8300368dfebc5275b; path=/; httpOnly;]</td>
	</tr>
	<tr class="hash_row">
		<td class="hash_key">X-Powered-By</td>
		<td class="hash_value">ASP.NET</td>
	</tr>
	<tr class="hash_row">
		<td class="hash_key">Date</td>
		<td class="hash_value">Wed, 01 Jan 2020 21:19:33 GMT</td>
	</tr>
</table></td></tr>
	<tr class="slimRowColor5">
		<td>register prefix</td>
		<td>tempuri</td>
		<td>for namespace</td>
		<td><a href="http://tempuri.org">http://tempuri.org</a></td>
	</tr>
	<tr class="slimRowColor0">
		<td>check</td>
		<td>xPath</td>
		<td>//tempuri:AddIntegerResult/text()</td>
		<td><span class="pass">21</span></td>
	</tr>
</table>
</article></body></html>